[{"Review Id":1012498281,"User ID":"F56BD518A51995B4B15C795F849B981B","Display Name":"Aya W","User Name":"ayaw757","User Profile":"https://www.tripadvisor.com/Profile/ayaw757","User Avatar":"https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/f4/d0/default-avatar-2020-33.jpg","User Location":null,"User Is Verified":"No","Rating":5,"Additional Ratings":"Value:5\nRooms:5\nLocation:5\nCleanliness:5\nService:5\nSleep Quality:5","Review Title":"Talking about the conrad hotel and the staff there on the restaurant and the hotel how they are so kind and helpful in t","Review Text":"Alaa, the breakfast food was amazing and the staff was very friendly and nice I recommend you to come and visit the place and i want to talk about alaa his a siryan guy that works there in the restaurant his so nice and friendly and he was with us all the time there thanks to him a lot","Helpful Votes":0,"Photos":null,"Stay Date":"2025-06-30","Created Date":"2025-06-11","Published Date":"2025-06-10","Language":"en","Location":"Conrad Dubai","Location Id":1456254,"URL":"https://www.tripadvisor.com/ShowUserReviews-g295424-d1456254-r1012498281-Conrad_Dubai-Dubai_Emirate_of_Dubai.html"},{"Review Id":913157433,"User ID":"FC81142A957CDB95A744C058AA651EB6","Display Name":"Setsunana","User Name":"Setsunana","User Profile":"https://www.tripadvisor.com/Profile/Setsunana","User Avatar":"https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/f2/7a/default-avatar-2020-25.jpg","User Location":null,"User Is Verified":"No","Rating":5,"Additional Ratings":"Value:5\nLocation:5\nCleanliness:5\nService:5","Review Title":"Great value for money luxury property with great executive lounge, but quite dated and sometimes lackluster service","Review Text":"I have stayed at this hotel for almost two weeks and it was a great experience!\n\nThe location is great, the hotel is in the city center and it is next to the subway station.\nThere are also great restaurants nearby and a supermarket right around the corner.\n\nThe hotel is what you can expect from an luxury property, but the service quality is kinda of a mixed bag.\n\nDuring my entire stay I had a feeling that the majority of the front desk staff is quite overwhelmed with my request. \n\nThe first problem I had was the shower head, which didn't function at all and I had to call the front desk 3 times and they couldn't fix the issue. Only after complaining to the executive lounge staff they managed to fix my issue with the shower. \n\nWhen I had basic request, like calling for room cleaning and restocking of amenities the staff on the phone didn't know how to respond to my request. \n\nThere was also no welcome when I returned to the hotel by any staff member downstairs which is kind of letdown for a luxury property, especially if you stayed there for over 10 nights. The staff downstairs and in the breakfast just doesn't seem to bother with remembering their customers.\n\nThe service at the breakfast buffet was also quite lackluster. While the breakfast selection was quite good, no one bothered with asking for any coffee or tea during my entire stay. The staff didn't take care of used tableware and they didn't replace my used cutlery. Even at 7 am when it was quite empty the staff would rather talk with themselves rather than serving the customers. \n\nThe breakfast itself was very good. You have a lot of selection and the quality of the food was very good. I enjoyed the food at the breakfast, especially the arabic options were a hit. The breakfast pizza and the omelets were also quite good. Sadly no Eggs Benedict, which is a must for me in a luxury property, but that's not a dealbreaker. \n\nThe best part about my entire stay was the executive lounge. The executive lounge has a great view and featured awesome snacks during the day. \nWhile it was quite crowded during the happy hour the staff really tried the best to accommodate everyone. \n\nI especially enjoyed talking with the staff members in the executive lounge. They remembered me even after the first day and were always attentive, nice and friendly. I had awesome conversations with a lot of them and I felt their passion for their work. They were really the highlight of my stay and I would spend the majority of my time in the lounge because it was just an awesome experience. \n\nEvery problem that needed fixing were handled as fast as possible and I didn't have any request that couldn't be fulfilled by the executive lounge staff. The staff in the lounge also spoke a lot better English than the staff downstairs, which made communicating with them a lot easier. \n\nThe In-Room dining experience was good, but the quality of some of the food was just alright. The cleanup took a lot of time and I had to call them multiple times one night. \n\nThe elite member treatment was really good and I got upgraded during my stay (standard room to executive and corner room). \n\nThe room itself is really big, even for the most basic room. It featured everything you expect from a luxury property and it was well cleaned throughout my stay. The sad thing about the room is that it is quite old and needs refurbishment. \nWhile the executive room is just the standard room with executive lounge access (which you already have as an diamond member), I would recommend booking it if you are not a diamond member, because the executive lounge is as I mentioned the best part of the hotel. \n\nThe corner room on the other hand was a great room with an awesome view and I enjoyed the room! \n\nI paid around 5900AED for my 12 night stay and I would do so again. \nI recommend staying in this hotel for everyone, but definitely book an executive room if you do not have executive lounge access with your Hilton Honors Status. The service is top notch in the lounge, but everywhere else is just kind of mediocre. The hardware is quite dated but for around 500 AED a night it is worth every cent.\n\n","Helpful Votes":1,"Photos":null,"Stay Date":"2023-07-31","Created Date":"2023-08-27","Published Date":"2023-08-26","Language":"en","Location":"Conrad Dubai","Location Id":1456254,"URL":"https://www.tripadvisor.com/ShowUserReviews-g295424-d1456254-r913157433-Conrad_Dubai-Dubai_Emirate_of_Dubai.html"},{"Review Id":1012388558,"User ID":"1739B7E4C41103EFBE3EC234E2869EB0","Display Name":"Nicola A","User Name":"nicolaaW6638QC","User Profile":"https://www.tripadvisor.com/Profile/nicolaaW6638QC","User Avatar":"https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/f0/d5/default-avatar-2020-17.jpg","User Location":null,"User Is Verified":"No","Rating":5,"Additional Ratings":"","Review Title":"Exzellentes 5-Sterne-Hotel der Hilton-Gruppe","Review Text":"Unser 1. Urlaub in Dubai und mit dem Conrad alles richtig gemacht!\nWir buchten einen Corner View Room und können diese Kategorie wärmstens empfehlen. An der Rezeption war Abil so nett und quartierte uns im 46. Stock ein - vielen herzlichen Dank dafür an ihn, wir hatten einen atemberaubenden Ausblick und konnten uns an der Skyline am Abend kaum satt sehen. \nDas Zimmer war unglaublich sauber und klassisch-elegant eingerichtet. Putri vom Housekeeping-Team war oft 3x täglich im Zimmer und versorgte uns mit Kaffee, Wasserflaschen, säuberte zuverlässig alles und richtete die Betten (übrigens selten so gut in einem Hotel geschlafen!) Vielen Dank an ihn!\nGenerell ist der Service im Conrad ausgezeichnet - ob Frühstück, Pool, Concierge, Rezeption. \nDie Nähe zur Metro (einfach aus der Lobby raus) ist ein weiterer Pluspunkt. \nAls besonders positiv empfanden wir das Frühstück sowie die oasengleiche Lage des Pools. \nWenn es Kritik geben sollte dann auf hohem Niveau: wir fanden das Schrank-Angebot im ansonsten wirklich großen Zimmer etwas mager (für 2 Personen etwas wenig Aufhängemöglichkeiten) und am Pool wäre gerade bei >40 Grad etwas mehr zusätzliche Schirm-Beschattung nötig. Die Sonnensegel reichen manchmal nicht ganz aus.","Helpful Votes":0,"Photos":null,"Stay Date":"2025-06-30","Created Date":"2025-06-10","Published Date":"2025-06-10","Language":"de","Location":"Conrad Dubai","Location Id":1456254,"URL":"https://www.tripadvisor.com/ShowUserReviews-g295424-d1456254-r1012388558-Conrad_Dubai-Dubai_Emirate_of_Dubai.html"},{"Review Id":1012366621,"User ID":"F7099B2D8D0D63673905EC0C8FCB56EB","Display Name":"Dreamer62730569330","User Name":"Dreamer62730569330","User Profile":"https://www.tripadvisor.com/Profile/Dreamer62730569330","User Avatar":"https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/df/99/default-avatar-2020-40.jpg","User Location":null,"User Is Verified":"No","Rating":3,"Additional Ratings":"Value:4\nRooms:4\nLocation:5\nCleanliness:4\nService:2\nSleep Quality:3","Review Title":"Hotel was okay but rude staff spoilt our trip","Review Text":"Overall the hotel stay was pretty good and we had an enjoyable 4 nights stay in the hotel except for the room pillows which were pretty flat and uncomfortable and the bed gave us a backache. \n\nWhat disappointed me most was the fact that the concierge staff are poorly trained with different staff giving us different instructions on what to do. On the day we arrived, we asked the Concierge about the YAS shuttle bus to bring us to Abu Dhabi YAS Island on the 10th as we would be staying there. We got conflicting information on whether to there was a need to book or not but both time, the staff informed us that we just had to wait in the lobby by 9.30am and the YAS bus driver will come into the lobby to gather the guests taking the shuttle. \n\nOn the 9th we made arrangements with the concierge that 2 of us would be travelling on the YAS shuttle bus and gave our details. \n\nOn the morning of 10th, we checked out and was at the lobby at 9.30 and also informed the check out staff at the concierge that we were catching the YAS transport and asked if the bus would be coming here and we should wait at the lobby and we were informed to do so. \n\nWe waited in the lobby till 10.10am and there was no signs of the bus and neither did any driver come through to ask if any of us were taking the YAS transport. I proceeded to the concierge at the side to ask about the bus and there was this tall man who very rudely retorted that the bus left 20 mins ago and we should have informed them that we wanted to take the bus. I informed him that we made the booking and nobody told us to come to this concierge to inform that we were taking the bus. And the staff said matter of factly that it was our own fault for missing the transport and we can make our way to Deira to take the transport ourselves if we wish to catch the transport. I was shocked that not only did the staff miscommunicate the information about the bus on where to wait, what to do and still faulted us. \n\nI went to lodge a complain at the main check in concierge and was directly to the Chief Concierge Mr Harry Banez who immediately assisted us by checking with the same rude staff at the concierge about where the YAS bus is. I was standing about less than 1m away from the desk and I can hear the rude staff proclaiming loudly \"THE BUS LEFT! THE BUS WONT COME IN HERE! THEY SHOULD HAVE WAITED OUTSIDE IF THEY WANNA TAKE THE BUS!\"\n\nThis is unacceptable and extremely rude and unprofessional of the staff to behave in this manner. He and he alone spoilt my trip and my impression of the hotel and dismayed that I was being treated like an idiot and faulted for something which I was not given clear instructions of. \n\nApparently the bus did not come and the staff tried to contact the YAS shuttle driver and Mr Harry also showed me that they had already informed them about our intention to take the bus. Mr Harry then arranged for a transport to take us to Deira City Centre to catch the YAS shuttle on time. Thank you Mr Harry for saving our day.","Helpful Votes":0,"Photos":null,"Stay Date":"2025-06-30","Created Date":"2025-06-10","Published Date":"2025-06-10","Language":"en","Location":"Conrad Dubai","Location Id":1456254,"URL":"https://www.tripadvisor.com/ShowUserReviews-g295424-d1456254-r1012366621-Conrad_Dubai-Dubai_Emirate_of_Dubai.html"},{"Review Id":1011890224,"User ID":"629B24719D9F8B07853271BAEDE6B7BC","Display Name":"cervpeare","User Name":"cervpeare","User Profile":"https://www.tripadvisor.com/Profile/cervpeare","User Avatar":"https://media-cdn.tripadvisor.com/media/photo-l/01/2a/fd/a0/avatar.jpg","User Location":null,"User Is Verified":"No","Rating":5,"Additional Ratings":"Value:4\nRooms:5\nLocation:5\nCleanliness:5\nService:4\nSleep Quality:5","Review Title":"great pools and spa facilties","Review Text":"comfy large rooms.  feather soft pillows.  Bed was too mushy and the bathroom slightly dated but still nice\n\nexcellent breakfast\n\nexcellent pool.   Sauna and steam room free to use for guests.  Pool closes at 7pm (too early)\n\nlocated next to train station","Helpful Votes":0,"Photos":null,"Stay Date":"2025-06-30","Created Date":"2025-06-09","Published Date":"2025-06-09","Language":"en","Location":"Conrad Dubai","Location Id":1456254,"URL":"https://www.tripadvisor.com/ShowUserReviews-g295424-d1456254-r1011890224-Conrad_Dubai-Dubai_Emirate_of_Dubai.html"},{"Review Id":1011791200,"User ID":"F47F3F63D5DFC44239B9152B2C1F08B3","Display Name":"Dr. Hanna","User Name":"Stay01359882651","User Profile":"https://www.tripadvisor.com/Profile/Stay01359882651","User Avatar":null,"User Location":"Bahrain","User Is Verified":"No","Rating":5,"Additional Ratings":"","Review Title":"Thank you Fahed","Review Text":"Thank you to the phenomenal Restaurant Manager Fahed for the remarkable experience in Conrad\n\nThe flexibility, attentive to details and beautiful care made our experience superior. We had specific requests were taken care of extremely well and we look forward to coming back","Helpful Votes":0,"Photos":null,"Stay Date":"2025-06-30","Created Date":"2025-06-09","Published Date":"2025-06-09","Language":"en","Location":"Conrad Dubai","Location Id":1456254,"URL":"https://www.tripadvisor.com/ShowUserReviews-g295424-d1456254-r1011791200-Conrad_Dubai-Dubai_Emirate_of_Dubai.html"},{"Review Id":1011752081,"User ID":"9852D3C9D322B121424B4D34CA1C569A","Display Name":"Tqctda A","User Name":"tqctdaa","User Profile":"https://www.tripadvisor.com/Profile/tqctdaa","User Avatar":"https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/f2/11/default-avatar-2020-23.jpg","User Location":null,"User Is Verified":"No","Rating":5,"Additional Ratings":"Value:5\nRooms:5\nLocation:5\nCleanliness:5\nService:5\nSleep Quality:5","Review Title":"Excellent place and amazing experience","Review Text":"Dear Michel, Dear Omar, and team\nMany thanks for the great hospitality shown during our stay in Conrad over the Eid holiday\nIt was a real amazing experience, and your team has shown professional handling, which is landmark for the Conrad hotels\nMany thanks again, and see you soon\nBr\nFathi","Helpful Votes":0,"Photos":null,"Stay Date":"2025-06-30","Created Date":"2025-06-09","Published Date":"2025-06-08","Language":"en","Location":"Conrad Dubai","Location Id":1456254,"URL":"https://www.tripadvisor.com/ShowUserReviews-g295424-d1456254-r1011752081-Conrad_Dubai-Dubai_Emirate_of_Dubai.html"},{"Review Id":1011650880,"User ID":"C75EA940AAEA12AFCAC6EC1234E9B20A","Display Name":"Ben mazhouda K","User Name":"benmazhoudak","User Profile":"https://www.tripadvisor.com/Profile/benmazhoudak","User Avatar":"https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/e2/e6/default-avatar-2020-45.jpg","User Location":null,"User Is Verified":"No","Rating":5,"Additional Ratings":"","Review Title":"Cool place","Review Text":"Came here with friends at around 4pm , I liked the vibes .the pool was also nice and spacious . We ordered some drinks during the happy hour from 3pm to 5pm where you buy one and you get one free, the nachos were nice too . Definitely recommend it ^^","Helpful Votes":0,"Photos":null,"Stay Date":"2025-06-30","Created Date":"2025-06-08","Published Date":"2025-06-08","Language":"en","Location":"Conrad Dubai","Location Id":1456254,"URL":"https://www.tripadvisor.com/ShowUserReviews-g295424-d1456254-r1011650880-Conrad_Dubai-Dubai_Emirate_of_Dubai.html"},{"Review Id":1011650453,"User ID":"38D0CA6243354C183BBE4A5B115986EF","Display Name":"Mounfaloti L","User Name":"E5343PPlolam","User Profile":"https://www.tripadvisor.com/Profile/E5343PPlolam","User Avatar":"https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/e7/99/default-avatar-2020-57.jpg","User Location":null,"User Is Verified":"No","Rating":5,"Additional Ratings":"Location:5\nCleanliness:5\nService:5","Review Title":"Flawless pool day","Review Text":"Experiencing Conrad for the first time ! \nI’ll definitely come back . \nthe service was on point , \nwe were assisted in every step of the day by Joseph , \nhis attention to details made us really impressed , \nPool day was outstanding !!!!!!!!!!!!!!!!!","Helpful Votes":0,"Photos":null,"Stay Date":"2025-06-30","Created Date":"2025-06-08","Published Date":"2025-06-08","Language":"en","Location":"Conrad Dubai","Location Id":1456254,"URL":"https://www.tripadvisor.com/ShowUserReviews-g295424-d1456254-r1011650453-Conrad_Dubai-Dubai_Emirate_of_Dubai.html"},{"Review Id":1011622089,"User ID":"34B26CF678AE7A55BC388C3D59B43B73","Display Name":"Frequent_Traveller","User Name":"frequent_travelle101","User Profile":"https://www.tripadvisor.com/Profile/frequent_travelle101","User Avatar":"https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/f1/42/default-avatar-2020-20.jpg","User Location":"Germany","User Is Verified":"No","Rating":5,"Additional Ratings":"","Review Title":"Again a great stay","Review Text":"We stayed at this hotel for the third time and again it was a very great stay! It was also nice to see some familiar faces again in the executive lounge, by the pool, and in the restaurant, so you feel right at home! In particular, I would like to thank the Executive Lounge, the restaurant staff, and the pool for the great time!\n\nOnly the air conditioning in the corner room I found very noisy!","Helpful Votes":0,"Photos":"https://media-cdn.tripadvisor.com/media/photo-w/30/19/c0/94/caption.jpg","Stay Date":"2025-05-31","Created Date":"2025-06-08","Published Date":"2025-06-08","Language":"en","Location":"Conrad Dubai","Location Id":1456254,"URL":"https://www.tripadvisor.com/ShowUserReviews-g295424-d1456254-r1011622089-Conrad_Dubai-Dubai_Emirate_of_Dubai.html"},{"Review Id":1011523207,"User ID":"3D956605CB416891B59CFDC325F44BB7","Display Name":"Hedieh","User Name":"510hediehm","User Profile":"https://www.tripadvisor.com/Profile/510hediehm","User Avatar":"https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/e5/2b/default-avatar-2020-52.jpg","User Location":"Iran","User Is Verified":"No","Rating":5,"Additional Ratings":"","Review Title":"If you want a hotel with good access and cleaning,I recommend this hotel.","Review Text":"We had very good stay.the hotel access,breakfast and cleaning was good.the pool was not very big but it was allowable.our room had good conditions and equipment.hotel’s breakfast was the turning point.the staff behave were polite.if you want good stay I recommend this hotel.","Helpful Votes":0,"Photos":null,"Stay Date":"2025-06-30","Created Date":"2025-06-07","Published Date":"2025-06-07","Language":"en","Location":"Conrad Dubai","Location Id":1456254,"URL":"https://www.tripadvisor.com/ShowUserReviews-g295424-d1456254-r1011523207-Conrad_Dubai-Dubai_Emirate_of_Dubai.html"},{"Review Id":1011487846,"User ID":"7AD0AB359C48B2AF261180C3B2671DAC","Display Name":"dongjae L","User Name":"dongjael36","User Profile":"https://www.tripadvisor.com/Profile/dongjael36","User Avatar":"https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/e9/bb/default-avatar-2020-65.jpg","User Location":null,"User Is Verified":"No","Rating":5,"Additional Ratings":"Value:5\nRooms:5\nLocation:5\nCleanliness:5\nService:5\nSleep Quality:5","Review Title":"Like famillious mind hotel!!","Review Text":"Wonderfull sweet hotel!!\nLocation is good! Metro red line conected!! Concierge team is perfect!!!\nI  losted my shopping bag in dubai mall, so i asked call the mall by chat! Concierge team found my bag!! I get back my bag!! Thank you!! Andrea!!","Helpful Votes":0,"Photos":null,"Stay Date":"2025-06-30","Created Date":"2025-06-07","Published Date":"2025-06-07","Language":"en","Location":"Conrad Dubai","Location Id":1456254,"URL":"https://www.tripadvisor.com/ShowUserReviews-g295424-d1456254-r1011487846-Conrad_Dubai-Dubai_Emirate_of_Dubai.html"},{"Review Id":1011346672,"User ID":"DAC9C8AEE8BD7EAA5E9C69771D5AA279","Display Name":"Artie G","User Name":"874artieg","User Profile":"https://www.tripadvisor.com/Profile/874artieg","User Avatar":"https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/e7/7b/default-avatar-2020-56.jpg","User Location":null,"User Is Verified":"No","Rating":5,"Additional Ratings":"Value:5\nRooms:5\nLocation:5\nCleanliness:5\nService:5\nSleep Quality:5","Review Title":"5 star worthy!! 🌟🌟🌟🌟🌟","Review Text":"Nice hotel with all kinds of facilities, room service and in room dining definitely recommended! Friendly people and very helpful. Room is well cleaned daily by Pia. Pool and lounge area give a very relaxing feeling.","Helpful Votes":0,"Photos":null,"Stay Date":"2025-06-30","Created Date":"2025-06-06","Published Date":"2025-06-06","Language":"en","Location":"Conrad Dubai","Location Id":1456254,"URL":"https://www.tripadvisor.com/ShowUserReviews-g295424-d1456254-r1011346672-Conrad_Dubai-Dubai_Emirate_of_Dubai.html"},{"Review Id":1011229352,"User ID":"51D872934036608ADC4B267AE22E497C","Display Name":"Mehera M","User Name":"mehera126","User Profile":"https://www.tripadvisor.com/Profile/mehera126","User Avatar":"https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/f0/d5/default-avatar-2020-17.jpg","User Location":"Dubai","User Is Verified":"No","Rating":5,"Additional Ratings":"Value:5\nRooms:5\nLocation:5\nCleanliness:5\nService:5\nSleep Quality:5","Review Title":"Great experience in conrad luxury hotel","Review Text":"We loved the hotel from the room the pool area the executive lounge then the lobby is beautiful great team service from the Entrance all round friendly and engaging….also we grateful to Juliana she really went out of the way to help us also dennis …. Till next time conrad is the best so far we have visited in dubai","Helpful Votes":0,"Photos":"https://media-cdn.tripadvisor.com/media/photo-w/30/13/31/42/caption.jpg","Stay Date":"2025-06-30","Created Date":"2025-06-05","Published Date":"2025-06-05","Language":"en","Location":"Conrad Dubai","Location Id":1456254,"URL":"https://www.tripadvisor.com/ShowUserReviews-g295424-d1456254-r1011229352-Conrad_Dubai-Dubai_Emirate_of_Dubai.html"},{"Review Id":1011205284,"User ID":"DBAE1E1CFCB89DAF787AA393F87DB899","Display Name":"Go20541646890","User Name":"Go20541646890","User Profile":"https://www.tripadvisor.com/Profile/Go20541646890","User Avatar":"https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/e2/e6/default-avatar-2020-45.jpg","User Location":null,"User Is Verified":"No","Rating":5,"Additional Ratings":"Value:5\nRooms:5\nLocation:4\nCleanliness:5\nService:5\nSleep Quality:5","Review Title":"Definitely recommend","Review Text":"My experience at the Conrad Dubai has been amazing! From the service, to the ambiance and decorations, to the concierge and car services, you will find everything you need here. I loved how attentive Juliana was in always helping me find a ride to my destination, or simply just checking in to make sure everything was going well with my stay, she is who I imagine when I think of top notch hospitality. 10/10 recommend staying here and you’ll meet so many kind staff.","Helpful Votes":0,"Photos":null,"Stay Date":"2025-05-31","Created Date":"2025-06-05","Published Date":"2025-06-05","Language":"en","Location":"Conrad Dubai","Location Id":1456254,"URL":"https://www.tripadvisor.com/ShowUserReviews-g295424-d1456254-r1011205284-Conrad_Dubai-Dubai_Emirate_of_Dubai.html"},{"Review Id":1011031032,"User ID":"9DD4C580E64A0AC7D09DF1D0CED52769","Display Name":"FARIBA P","User Name":"faribap340","User Profile":"https://www.tripadvisor.com/Profile/faribap340","User Avatar":"https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/f4/d0/default-avatar-2020-33.jpg","User Location":null,"User Is Verified":"No","Rating":5,"Additional Ratings":"","Review Title":"Appreciation","Review Text":"I was so happy with the room service cleaning our room, your colleague Ms.Pia ,she is very kind polite and hany, i really appreciate .thanks for choosing such colleagues. The location of the hotel is very accessible to all transportation\nSincerely \nFariba panahi","Helpful Votes":0,"Photos":null,"Stay Date":"2025-06-30","Created Date":"2025-06-04","Published Date":"2025-06-03","Language":"en","Location":"Conrad Dubai","Location Id":1456254,"URL":"https://www.tripadvisor.com/ShowUserReviews-g295424-d1456254-r1011031032-Conrad_Dubai-Dubai_Emirate_of_Dubai.html"},{"Review Id":1010894601,"User ID":"5C38D3809B54C799216284DDBD6399EA","Display Name":"Jasmine A","User Name":"Jvsmn7","User Profile":"https://www.tripadvisor.com/Profile/Jvsmn7","User Avatar":"https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/e7/7b/default-avatar-2020-56.jpg","User Location":null,"User Is Verified":"No","Rating":5,"Additional Ratings":"Value:5\nRooms:5\nLocation:5\nCleanliness:5\nService:5\nSleep Quality:5","Review Title":"GREAT EXPERIENCE","Review Text":"Very great hotel, all the team are amazing, front desk, concierge, restaurant and lounge staff. I come every year and i am never disappointed. calm hotel, great location, and nice pool and restaurants. I want to thank all the team for the great exeprience","Helpful Votes":0,"Photos":null,"Stay Date":"2025-05-31","Created Date":"2025-06-03","Published Date":"2025-06-03","Language":"en","Location":"Conrad Dubai","Location Id":1456254,"URL":"https://www.tripadvisor.com/ShowUserReviews-g295424-d1456254-r1010894601-Conrad_Dubai-Dubai_Emirate_of_Dubai.html"},{"Review Id":1010893071,"User ID":"69DBAFA2F1B6553ADBAEB6854220EF23","Display Name":"fannyh463","User Name":"fannyh463","User Profile":"https://www.tripadvisor.com/Profile/fannyh463","User Avatar":null,"User Location":"Heidesheim","User Is Verified":"No","Rating":5,"Additional Ratings":"","Review Title":"Breathtaking every time","Review Text":"The Hotel ist great and perfectly located.  You can use the metro infront of the hotel or take a rental car to go to the mall or beach very easily.\n\nThe staff is always so friendly and kind also to child’s and babies. \n\nThe Housekeeping by Chetra was amazing - thanks for the flowers \nIt our 3rd time in this hotel and we enjoyed it every time.","Helpful Votes":1,"Photos":"https://media-cdn.tripadvisor.com/media/photo-w/30/0d/a3/5f/caption.jpg","Stay Date":"2025-06-30","Created Date":"2025-06-03","Published Date":"2025-06-03","Language":"en","Location":"Conrad Dubai","Location Id":1456254,"URL":"https://www.tripadvisor.com/ShowUserReviews-g295424-d1456254-r1010893071-Conrad_Dubai-Dubai_Emirate_of_Dubai.html"},{"Review Id":1010837496,"User ID":"EFE375914E764186DEA55B966482912B","Display Name":"Vida A","User Name":"vidaa170","User Profile":"https://www.tripadvisor.com/Profile/vidaa170","User Avatar":null,"User Location":null,"User Is Verified":"No","Rating":5,"Additional Ratings":"Value:5\nRooms:5\nLocation:5\nCleanliness:5\nService:5\nSleep Quality:4","Review Title":"Nice experience","Review Text":"Room was very clean and functional, beautiful designed and appointed. \nService was excellent and attentive.\nBreakfast was delicious 😋 \nOverall, I really enjoyed my stay.\nLocation was perfect. Very central and close to all the major attractions.","Helpful Votes":0,"Photos":null,"Stay Date":"2025-05-31","Created Date":"2025-06-02","Published Date":"2025-06-02","Language":"en","Location":"Conrad Dubai","Location Id":1456254,"URL":"https://www.tripadvisor.com/ShowUserReviews-g295424-d1456254-r1010837496-Conrad_Dubai-Dubai_Emirate_of_Dubai.html"},{"Review Id":1010541487,"User ID":"B3C3752BD5EAF07F82FE63A8C371DE81","Display Name":"NvrStop","User Name":"NvrStop","User Profile":"https://www.tripadvisor.com/Profile/NvrStop","User Avatar":"https://media-cdn.tripadvisor.com/media/photo-o/1a/f6/eb/6d/default-avatar-2020-19.jpg","User Location":"Houston","User Is Verified":"No","Rating":4,"Additional Ratings":"","Review Title":"Excellent service and location for a cost effective hotel in Dubai","Review Text":"Spacious and well equipped bedroom suites with extraordinary housekeeping and laundry staff, extravagant offerings at breakfast (though no cooked to order items) and personalized service at the executive lounge were positive elements at this property. Menbere provided outstanding and memorable service at the executive lounge, and many other members of the spa and housekeeping staff also created a feeling of luxury and elegance. The location of the property right next to the metro and central to all the areas we visited was another plus. \n\nRestriction of the availability of alcohol at the lounge other than from 6-8 pm and limited restaurant options compared to the Abu Dhabi property were the reason that a 5th star was withheld.","Helpful Votes":0,"Photos":"https://media-cdn.tripadvisor.com/media/photo-w/30/08/4b/7f/caption.jpg","Stay Date":"2025-05-31","Created Date":"2025-06-01","Published Date":"2025-05-31","Language":"en","Location":"Conrad Dubai","Location Id":1456254,"URL":"https://www.tripadvisor.com/ShowUserReviews-g295424-d1456254-r1010541487-Conrad_Dubai-Dubai_Emirate_of_Dubai.html"}]